# coding: utf-8
from __future__ import absolute_import, print_function
from sage.all import vector, Permutations, prod
from . import HRepr, weyl_module, StabilizerGroup, perm_action, external_tensor_product, qmp

__all__ = [
    'KLYACHKO_FERMI_SCENARIOS',
    'klyachko_fermi_hrepr',
    'KLYACHKO_QMP_SCENARIOS',
    'KLYACHKO_GOOD_QMP_SCENARIOS',
    'klyachko_qmp_hrepr',
    '_klyachko_qmp_bare_ieqs',  # for unit testing
]

# these inequalities are from Altunbulak and Klyachko (2008)
KLYACHKO_FERMI_DATA = {
    (3, 6):
    u"""λ 1 + λ 6 = 1
       λ 2 + λ 5 = 1
       λ 3 + λ 4 = 1
       λ 4 - λ 5 - λ 6 ≤ 0""",
    (3, 7):
    u"""λ 2 + λ 3 + λ 4 + λ 5 ≤ 2
       λ 1 + λ 3 + λ 4 + λ 6 ≤ 2
       λ 1 + λ 2 + λ 4 + λ 7 ≤ 2
       λ 1 + λ 2 + λ 5 + λ 6 ≤ 2""",
    (3, 8):
    u"""λ 2 + λ 3 + λ 4 + λ 5 ≤ 2
       λ 1 + λ 2 + λ 4 + λ 7 ≤ 2
       λ 1 + λ 3 + λ 4 + λ 6 ≤ 2
       λ 1 + λ 2 + λ 5 + λ 6 ≤ 2
       λ 1 + λ 2 − λ 3 ≤ 1
       λ 2 + λ 5 − λ 7 ≤ 1
       λ 1 + λ 6 − λ 7 ≤ 1
       λ 2 + λ 4 − λ 6 ≤ 1
       λ 1 + λ 4 − λ 5 ≤ 1
       λ 3 + λ 4 − λ 7 ≤ 1
       λ 1 + λ 8 ≤ 1
       λ 2 − λ 3 − λ 6 − λ 7 ≤ 0
       λ 4 − λ 5 − λ 6 − λ 7 ≤ 0
       λ 1 − λ 3 − λ 5 − λ 7 ≤ 0
       λ 2 + λ 3 + 2λ 4 − λ 5 − λ 7 + λ 8 ≤ 2
       λ 1 + λ 3 + 2λ 4 − λ 5 − λ 6 + λ 8 ≤ 2
       λ 1 + 2λ 2 − λ 3 + λ 4 − λ 5 + λ 8 ≤ 2
       λ 1 + 2λ 2 − λ 3 + λ 5 − λ 6 + λ 8 ≤ 2
       λ 1 + λ 2 − 2λ 3 − λ 4 − λ 5 ≤ 0
       λ 1 − λ 2 − λ 3 + λ 6 − 2λ 7 ≤ 0
       λ 1 − λ 3 − λ 4 − λ 5 + λ 8 ≤ 0
       λ 1 − λ 2 − λ 3 − λ 7 + λ 8 ≤ 0
       2λ 1 − λ 2 + λ 4 − 2λ 5 − λ 6 + λ 8 ≤ 1
       λ 3 + 2λ 4 − 2λ 5 − λ 6 − λ 7 + λ 8 ≤ 1
       2λ 1 − λ 2 − λ 4 + λ 6 − 2λ 7 + λ 8 ≤ 1
       2λ 1 + λ 2 − 2λ 3 − λ 4 − λ 6 + λ 8 ≤ 1
       λ 1 + 2λ 2 − 2λ 3 − λ 5 − λ 6 + λ 8 ≤ 1
       2λ 1 − 2λ 2 − λ 3 − λ 4 + λ 6 − 3λ 7 + λ 8 ≤ 0
       −λ 1 + λ 3 + 2λ 4 − 3λ 5 − 2λ 6 − λ 7 + λ 8 ≤ 0
       2λ 1 + λ 2 − 3λ 3 − 2λ 4 − λ 5 − λ 6 + λ 8 ≤ 0
       λ 1 + 2λ 2 − 3λ 3 − λ 4 − 2λ 5 − λ 6 + λ 8 ≤ 0""",
    (4, 8):
    u"""λ 1 ≤ 1
       λ 5 − λ 6 − λ 7 − λ 8 ≤ 0
       λ 1 − λ 2 − λ 7 − λ 8 ≤ 0
       λ 1 − λ 3 − λ 6 − λ 8 ≤ 0
       λ 1 − λ 4 − λ 6 − λ 7 ≤ 0
       λ 1 − λ 4 − λ 5 − λ 8 ≤ 0
       λ 3 − λ 4 − λ 7 − λ 8 ≤ 0
       λ 2 − λ 4 − λ 6 − λ 8 ≤ 0
       λ 2 + λ 3 + λ 5 − λ 8 ≤ 2
       λ 1 + λ 3 + λ 6 − λ 8 ≤ 2
       λ 1 + λ 2 + λ 7 − λ 8 ≤ 2
       λ 1 + λ 2 + λ 3 − λ 4 ≤ 2
       λ 1 + λ 4 + λ 5 − λ 8 ≤ 2
       λ 1 + λ 2 + λ 5 − λ 6 ≤ 2
       λ 1 + λ 3 + λ 5 − λ 7 ≤ 2""",
}

#: Scenarios :math:`(n,d)`, corresponding to the representation of :math:`GL(d)` on the anti-symmetric power :math:`\bigwedge^n \mathbb C^d`.
KLYACHKO_FERMI_SCENARIOS = sorted(KLYACHKO_FERMI_DATA.keys())


def _parse_fermi_ieq(d, s, split_at):
    """Parse a fermionic inequality in Klyachko's format."""
    H = [0] * d
    s = s.rstrip(" ,.").replace(u"−", "-").replace(u"λ", " A").replace(u"-A",
                                                                       "- A")
    lhs, rhs = map(lambda s: str(s).strip(), s.split(split_at))
    if lhs[0] not in ["+", "-"]:
        lhs = "+ " + lhs
    todo = lhs.split()
    while todo:
        assert todo[0] in ["+", "-"]
        sign = 1 if todo[0] == "+" else -1
        if todo[1] == "A":
            todo = [todo[0]] + ["1"] + todo[1:]
        coeff = int(todo[1])
        assert todo[2] == "A"
        idx = int(todo[3])
        H[idx - 1] = -sign * coeff
        todo = todo[4:]
    c = -int(rhs)
    return (vector(H), c)


def klyachko_fermi_hrepr(n, d, bare=False):
    r"""Return the moment polytope for the :math:`GL(d)`-representation on :math:`\bigwedge^n \mathbb C^d` as computed in `Altunbulak and Klyachko (2008) <https://arxiv.org/abs/0802.0918>`_.

    See :data:`KLYACHKO_FERMI_SCENARIOS` for available scenarios.

    :param n: the antisymmetric power.
    :param d: the rank of the group.
    :param bare: if ``True`` then the reduced Weyl chamber inequalities are omitted.
    :rtype: :class:`moment_polytopes.HRepr`
    """
    # retrieve inequalities from data file
    ieqs = []
    eqns = []
    for line in KLYACHKO_FERMI_DATA[n, d].splitlines():
        line = line.strip()
        if not line: continue
        is_equation = '=' in line
        if is_equation:
            eqns.append(_parse_fermi_ieq(d, line, '='))
        else:
            ieqs.append(_parse_fermi_ieq(d, line, u'≤'))
    hrepr = HRepr(ieqs=ieqs, eqns=eqns)

    # intersect with reduced Weyl chamber
    if not bare:
        R = weyl_module(d, [1] * n)
        hrepr = hrepr & R.reduced_positive_weyl_chamber_hrepr

    return hrepr


# these inequalities are from Klyachko (2004)
KLYACHKO_QMP_DATA = {
    (3, 2, 6):
    u"""µ 1 − µ 2 ≤ ν 1 + ν 2 + ν 3 − ν 4 − ν 5 − ν 6 .
    λ 1 + λ 2 − 2λ 3 ≤ ν 1 + ν 2 + ν 3 + ν 4 − 2ν 5 − 2ν 6 ,
    λ 2 + λ 3 − 2λ 1 ≤ ν 1 + ν 2 + ν 3 + ν 6 − 2ν 4 − 2ν 5 .
    2λ 1 − λ 2 − λ 3 ≤ 2ν 1 + 2ν 2 − ν 3 − ν 4 − ν 5 − ν 6 ,
    2λ 3 − λ 1 − λ 2 ≤ 2ν 2 + 2ν 3 − ν 1 − ν 4 − ν 5 − ν 6 .
    2λ 1 − 2λ 3 − µ 2 + µ 1 ≤ 3ν 1 + ν 2 + ν 3 − ν 4 − ν 5 − 3ν 6 ,
    2λ 1 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 − ν 4 − ν 5 − 3ν 6 ,
    2λ 2 − 2λ 3 − µ 2 + µ 1 ≤ 3ν 2 + ν 1 + ν 3 − ν 4 − ν 5 − 3ν 6 ,
    2λ 1 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 4 − ν 3 − ν 5 − 3ν 6 ,
    2λ 1 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 4 − ν 3 − ν 5 − 3ν 6 ,
    2λ 1 − 2λ 2 − µ 2 + µ 1 ≤ 3ν 1 + ν 2 + ν 4 − ν 3 − ν 5 − 3ν 6 ,
    2λ 2 − 2λ 3 − µ 2 + µ 1 ≤ 3ν 1 + ν 2 + ν 4 − ν 3 − ν 5 − 3ν 6 ,
    2λ 3 − 2λ 1 − µ 2 + µ 1 ≤ 3ν 3 + ν 1 + ν 4 − ν 2 − ν 5 − 3ν 6 ,
    2λ 3 − 2λ 1 + µ 2 − µ 1 ≤ 3ν 3 + ν 2 + ν 4 − ν 1 − ν 5 − 3ν 6 ,
    2λ 3 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 3 + ν 4 − ν 1 − ν 5 − 3ν 6 ,
    2λ 3 − 2λ 1 − µ 2 + µ 1 ≤ 3ν 2 + ν 3 + ν 4 − ν 1 − ν 5 − 3ν 6 ,
    2λ 2 − 2λ 1 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 6 − ν 4 − ν 3 − 3ν 5 ,
    2λ 3 − 2λ 1 − µ 2 + µ 1 ≤ 3ν 1 + ν 2 + ν 6 − ν 4 − ν 3 − 3ν 5 ,
    2λ 2 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 4 − ν 3 − ν 6 − 3ν 5 ,
    2λ 1 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 − ν 4 − ν 6 − 3ν 5 ,
    2λ 2 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 − ν 4 − ν 6 − 3ν 5 ,
    2λ 1 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 − ν 6 − ν 4 − 3ν 5 ,
    2λ 1 − 2λ 2 − µ 2 + µ 1 ≤ 3ν 1 + ν 2 + ν 3 − ν 6 − ν 4 − 3ν 5 ,
    2λ 3 − 2λ 1 − µ 2 + µ 1 ≤ 3ν 1 + ν 2 + ν 5 − ν 3 − ν 6 − 3ν 4 ,
    2λ 3 − 2λ 1 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 6 − ν 3 − ν 5 − 3ν 4 .
    2λ 1 + 2λ 2 − 4λ 3 + 3µ 1 − 3µ 2 ≤ 5ν 1 + 5ν 2 − ν 3 − ν 4 − ν 5 − 7ν 6 ,
    2λ 3 + 2λ 1 − 4λ 2 + 3µ 1 − 3µ 2 ≤ 5ν 3 + 5ν 1 − ν 2 − ν 4 − ν 5 − 7ν 6 ,
    2λ 1 + 2λ 3 − 4λ 2 + 3µ 2 − 3µ 1 ≤ 5ν 2 + 5ν 3 − ν 1 − ν 4 − ν 5 − 7ν 6 ,
    2λ 2 + 2λ 3 − 4λ 1 + 3µ 1 − 3µ 2 ≤ 5ν 2 + 5ν 3 − ν 1 − ν 4 − ν 5 − 7ν 6 ,
    2λ 2 + 2λ 1 − 4λ 3 + 3µ 2 − 3µ 1 ≤ 5ν 1 + 5ν 2 − ν 3 − ν 6 − ν 4 − 7ν 5 ,
    2λ 3 + 2λ 1 − 4λ 2 + 3µ 1 − 3µ 2 ≤ 5ν 1 + 5ν 2 − ν 3 − ν 6 − ν 4 − 7ν 5 ,
    2λ 2 + 2λ 3 − 4λ 1 + 3µ 1 − 3µ 2 ≤ 5ν 1 + 5ν 3 − ν 2 − ν 6 − ν 4 − 7ν 5 ,
    2λ 2 + 2λ 3 − 4λ 1 + 3µ 1 − 3µ 2 ≤ 5ν 1 + 5ν 2 − ν 3 − ν 5 − ν 6 − 7ν 4 .
    4λ 1 − 2λ 2 − 2λ 3 + 3µ 1 − 3µ 2 ≤ 7ν 1 + ν 2 + ν 3 + ν 4 − 5ν 5 − 5ν 6 ,
    4λ 1 − 2λ 2 − 2λ 3 + 3µ 2 − 3µ 1 ≤ 7ν 2 + ν 1 + ν 3 + ν 4 − 5ν 5 − 5ν 6 ,
    4λ 2 − 2λ 1 − 2λ 3 + 3µ 1 − 3µ 2 ≤ 7ν 2 + ν 1 + ν 3 + ν 4 − 5ν 5 − 5ν 6 ,
    4λ 2 − 2λ 1 − 2λ 3 + 3µ 1 − 3µ 2 ≤ 7ν 1 + ν 2 + ν 3 + ν 5 − 5ν 4 − 5ν 6 ,
    4λ 3 − 2λ 1 − 2λ 2 + 3µ 1 − 3µ 2 ≤ 7ν 3 + ν 1 + ν 2 + ν 4 − 5ν 5 − 5ν 6 ,
    4λ 3 − 2λ 1 − 2λ 2 + 3µ 1 − 3µ 2 ≤ 7ν 2 + ν 1 + ν 3 + ν 5 − 5ν 4 − 5ν 6 ,
    4λ 2 − 2λ 1 − 2λ 3 + 3µ 2 − 3µ 1 ≤ 7ν 1 + ν 2 + ν 3 + ν 6 − 5ν 4 − 5ν 5 ,
    4λ 3 − 2λ 1 − 2λ 2 + 3µ 1 − 3µ 2 ≤ 7ν 1 + ν 2 + ν 3 + ν 6 − 5ν 4 − 5ν 5 .""",
    (4, 2, 8):
    u"""µ 1 − µ 2 ≤ ν 1 + ν 2 + ν 3 + ν 4 − ν 5 − ν 6 − ν 7 − ν 8 .
    λ 1 + λ 2 − λ 3 − λ 4 ≤ ν 1 + ν 2 + ν 3 + ν 4 − ν 5 − ν 6 − ν 7 − ν 8 ,
    λ 1 + λ 4 − λ 2 − λ 3 ≤ ν 1 + ν 2 + ν 4 + ν 5 − ν 3 − ν 6 − ν 7 − ν 8 ,
    λ 2 + λ 3 − λ 1 − λ 4 ≤ ν 1 + ν 2 + ν 3 + ν 6 − ν 4 − ν 5 − ν 7 − ν 8 ,
    λ 3 + λ 4 − λ 1 − λ 2 ≤ ν 2 + ν 3 + ν 4 + ν 5 − ν 1 − ν 6 − ν 7 − ν 8 ,
    λ 3 + λ 4 − λ 1 − λ 2 ≤ ν 1 + ν 2 + ν 3 + ν 8 − ν 4 − ν 5 − ν 6 − ν 7 .
    λ 1 + λ 2 + λ 3 − 3λ 4 ≤ ν 1 + ν 2 + ν 3 + ν 4 + ν 5 + ν 6 − 3ν 7 − 3ν 8 ,
    λ 1 + λ 3 + λ 4 − 3λ 2 ≤ ν 1 + ν 2 + ν 3 + ν 4 + ν 5 + ν 8 − 3ν 6 − 3ν 7 .
    3λ 1 − λ 2 − λ 3 − λ 4 ≤ 3ν 1 + 3ν 2 − ν 3 − ν 4 − ν 5 − ν 6 − ν 7 − ν 8 ,
    3λ 3 − λ 1 − λ 2 − λ 4 ≤ 3ν 2 + 3ν 3 − ν 1 − ν 4 − ν 5 − ν 6 − ν 7 − ν 8 .
    λ 1 + λ 2 + λ 3 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 6 − ν 7 − 5ν 8 ,
    λ 1 + λ 2 + λ 4 − 3λ 3 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 2 + 3ν 4 − ν 3 − ν 5 − ν 6 − ν 7 − 5ν 8 ,
    λ 1 + λ 2 + λ 3 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 3ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 6 − ν 8 − 5ν 7 ,
    λ 1 + λ 2 + λ 4 − 3λ 3 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 6 − ν 8 − 5ν 7 ,
    λ 1 + λ 3 + λ 4 − 3λ 2 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 3 + 3ν 4 − ν 2 − ν 5 − ν 6 − ν 7 − 5ν 8 ,
    λ 1 + λ 3 + λ 4 − 3λ 2 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 2 + 3ν 4 − ν 3 − ν 5 − ν 6 − ν 8 − 5ν 7 ,
    λ 1 + λ 3 + λ 4 − 3λ 2 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 7 − ν 8 − 5ν 6 ,
    λ 1 + λ 3 + λ 4 − 3λ 2 + 2µ 2 − 2µ 1 ≤ 3ν 2 + 3ν 3 + 3ν 4 − ν 1 − ν 5 − ν 6 − ν 7 − 5ν 8 ,
    λ 2 + λ 3 + λ 4 − 3λ 1 + 2µ 1 − 2µ 2 ≤ 3ν 2 + 3ν 3 + 3ν 4 − ν 1 − ν 5 − ν 6 − ν 7 − 5ν 8 ,
    λ 2 + λ 3 + λ 4 − 3λ 1 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 3 + 3ν 4 − ν 2 − ν 5 − ν 6 − ν 8 − 5ν 7 ,
    λ 2 + λ 3 + λ 4 − 3λ 1 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 2 + 3ν 4 − ν 3 − ν 5 − ν 7 − ν 8 − 5ν 6 ,
    λ 2 + λ 3 + λ 4 − 3λ 1 + 2µ 1 − 2µ 2 ≤ 3ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 6 − ν 7 − ν 8 − 5ν 5 .
    3λ 1 − λ 2 − λ 3 − λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + ν 2 + ν 3 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 3ν 8 ,
    3λ 1 − λ 2 − λ 3 − λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 2 + ν 1 + ν 3 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 3ν 8 ,
    3λ 2 − λ 1 − λ 3 − λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 2 + ν 1 + ν 3 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 3ν 8 ,
    3λ 2 − λ 1 − λ 3 − λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + ν 2 + ν 3 + ν 4 + ν 6 − 3ν 5 − 3ν 7 − 3ν 8 ,
    3λ 3 − λ 1 − λ 2 − λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 3 + ν 1 + ν 2 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 3ν 8 ,
    3λ 3 − λ 1 − λ 2 − λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 2 + ν 1 + ν 3 + ν 4 + ν 6 − 3ν 5 − 3ν 7 − 3ν 8 ,
    3λ 3 − λ 1 − λ 2 − λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + ν 2 + ν 3 + ν 4 + ν 7 − 3ν 5 − 3ν 6 − 3ν 8 ,
    3λ 4 − λ 1 − λ 2 − λ 3 + 2µ 1 − 2µ 2 ≤ 5ν 4 + ν 1 + ν 2 + ν 3 + ν 5 − 3ν 6 − 3ν 7 − 3ν 8 ,
    3λ 4 − λ 1 − λ 2 − λ 3 + 2µ 1 − 2µ 2 ≤ 5ν 3 + ν 1 + ν 2 + ν 4 + ν 6 − 3ν 5 − 3ν 7 − 3ν 8 ,
    3λ 4 − λ 1 − λ 2 − λ 3 + 2µ 1 − 2µ 2 ≤ 5ν 2 + ν 1 + ν 3 + ν 4 + ν 7 − 3ν 5 − 3ν 6 − 3ν 8 ,
    3λ 3 − λ 1 − λ 2 − λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 1 + ν 2 + ν 3 + ν 4 + ν 8 − 3ν 5 − 3ν 6 − 3ν 7 ,
    3λ 4 − λ 1 − λ 2 − λ 3 + 2µ 1 − 2µ 2 ≤ 5ν 1 + ν 2 + ν 3 + ν 4 + ν 8 − 3ν 5 − 3ν 6 − 3ν 7
    λ 1 + λ 2 − λ 3 − λ 4 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 2 − 2ν 7 − 2ν 8 ,
    λ 1 + λ 3 − λ 2 − λ 4 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 3 − 2ν 7 − 2ν 8 ,
    λ 1 + λ 3 − λ 2 − λ 4 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 2 − 2ν 6 − 2ν 8 ,
    λ 1 + λ 3 − λ 2 − λ 4 + µ 2 − µ 1 ≤ 2ν 2 + 2ν 3 − 2ν 7 − 2ν 8 ,
    λ 2 + λ 3 − λ 1 − λ 4 + µ 1 − µ 2 ≤ 2ν 2 + 2ν 3 − 2ν 7 − 2ν 8 ,
    λ 1 + λ 4 − λ 2 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 4 − 2ν 7 − 2ν 8 ,
    λ 1 + λ 4 − λ 2 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 3 − 2ν 6 − 2ν 8 ,
    λ 2 + λ 3 − λ 1 − λ 4 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 3 − 2ν 6 − 2ν 8 ,
    λ 2 + λ 3 − λ 1 − λ 4 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 2 − 2ν 5 − 2ν 8 ,
    λ 1 + λ 3 − λ 2 − λ 4 + µ 2 − µ 1 ≤ 2ν 1 + 2ν 2 − 2ν 6 − 2ν 7 ,
    λ 1 + λ 4 − λ 2 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 2 − 2ν 6 − 2ν 7 ,
    λ 1 + λ 4 − λ 2 − λ 3 + µ 2 − µ 1 ≤ 2ν 2 + 2ν 4 − 2ν 7 − 2ν 8 ,
    λ 2 + λ 4 − λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 2 + 2ν 4 − 2ν 7 − 2ν 8 ,
    λ 2 + λ 4 − λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 4 − 2ν 6 − 2ν 8 ,
    λ 1 + λ 4 − λ 2 − λ 3 + µ 2 − µ 1 ≤ 2ν 2 + 2ν 3 − 2ν 6 − 2ν 8 ,
    λ 2 + λ 4 − λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 2 + 2ν 3 − 2ν 6 − 2ν 8 ,
    λ 2 + λ 4 − λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 3 − 2ν 5 − 2ν 8 ,
    λ 2 + λ 3 − λ 1 − λ 4 + µ 2 − µ 1 ≤ 2ν 1 + 2ν 2 − 2ν 5 − 2ν 7 ,
    λ 2 + λ 4 − λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 2 − 2ν 5 − 2ν 7 ,
    λ 2 + λ 3 − λ 1 − λ 4 + µ 2 − µ 1 ≤ 2ν 1 + 2ν 3 − 2ν 6 − 2ν 7 ,
    λ 2 + λ 4 − λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 3 − 2ν 6 − 2ν 7 ,
    λ 3 + λ 4 − λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 3 + 2ν 4 − 2ν 7 − 2ν 8 ,
    λ 3 + λ 4 − λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 2 + 2ν 4 − 2ν 6 − 2ν 8
    λ 3 + λ 4 − λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 2 + 2ν 3 − 2ν 5 − 2ν 8 ,
    λ 3 + λ 4 − λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 3 − 2ν 5 − 2ν 7 ,
    λ 3 + λ 4 − λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 4 − 2ν 6 − 2ν 7 ,
    λ 3 + λ 4 − λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 1 + 2ν 2 − 2ν 5 − 2ν 6 .
    5λ 1 + λ 2 − 3λ 3 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 2 − 3λ 3 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 7ν 2 + 3ν 1 + 3ν 3 − ν 4 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 2 + λ 1 − 3λ 3 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 7ν 2 + 3ν 1 + 3ν 3 − ν 4 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 2 − 3λ 3 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 7ν 1 + 3ν 2 + 3ν 4 − ν 3 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 3 − 3λ 2 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 4 − ν 3 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 2 + λ 1 − 3λ 3 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 4 − ν 3 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 3 − 3λ 2 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 7 − 5ν 6 − 5ν 8 ,
    5λ 1 + λ 3 − 3λ 2 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 7ν 2 + 3ν 1 + 3ν 4 − ν 3 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 4 − 3λ 2 − 3λ 3 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 5 − ν 3 − ν 4 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 4 − 3λ 2 − 3λ 3 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 4 − ν 3 − ν 5 − ν 7 − 5ν 6 − 5ν 8 ,
    5λ 1 + λ 3 − 3λ 2 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 7ν 2 + 3ν 1 + 3ν 3 − ν 4 − ν 5 − ν 7 − 5ν 6 − 5ν 8 ,
    5λ 1 + λ 3 − 3λ 2 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 7ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 8 − 5ν 6 − 5ν 7 ,
    5λ 1 + λ 4 − 3λ 2 − 3λ 3 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 3 − ν 4 − ν 5 − ν 8 − 5ν 6 − 5ν 7 ,
    5λ 3 + λ 2 − 3λ 1 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 7ν 3 + 3ν 1 + 3ν 4 − ν 2 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 3 + λ 1 − 3λ 2 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 7ν 2 + 3ν 3 + 3ν 4 − ν 1 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 3 + λ 2 − 3λ 1 − 3λ 4 + 2µ 1 − 2µ 2 ≤ 7ν 2 + 3ν 3 + 3ν 4 − ν 1 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 4 − 3λ 2 − 3λ 3 + 2µ 2 − 2µ 1 ≤ 7ν 2 + 3ν 1 + 3ν 5 − ν 3 − ν 4 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 1 + λ 4 − 3λ 2 − 3λ 3 + 2µ 2 − 2µ 1 ≤ 7ν 2 + 3ν 1 + 3ν 4 − ν 3 − ν 5 − ν 7 − 5ν 6 − 5ν 8 ,
    5λ 1 + λ 4 − 3λ 2 − 3λ 3 + 2µ 2 − 2µ 1 ≤ 7ν 2 + 3ν 1 + 3ν 3 − ν 4 − ν 5 − ν 8 − 5ν 6 − 5ν 7 ,
    5λ 3 + λ 2 − 3λ 1 − 3λ 4 + 2µ 2 − 2µ 1 ≤ 7ν 3 + 3ν 2 + 3ν 4 − ν 1 − ν 5 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 4 + λ 3 − 3λ 1 − 3λ 2 + 2µ 1 − 2µ 2 ≤ 7ν 4 + 3ν 1 + 3ν 5 − ν 2 − ν 3 − ν 6 − 5ν 7 − 5ν 8 ,
    5λ 3 + λ 4 − 3λ 1 − 3λ 2 + 2µ 2 − 2µ 1 ≤ 7ν 1 + 3ν 2 + 3ν 8 − ν 3 − ν 4 − ν 5 − 5ν 6 − 5ν 7 ,
    5λ 4 + λ 3 − 3λ 1 − 3λ 2 + 2µ 1 − 2µ 2 ≤ 7ν 1 + 3ν 2 + 3ν 8 − ν 3 − ν 4 − ν 5 − 5ν 6 − 5ν 7
    3λ 1 + 3λ 2 − λ 3 − 5λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 7ν 8 ,
    3λ 1 + 3λ 3 − λ 2 − 5λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 3 + ν 2 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 7ν 8 ,
    3λ 1 + 3λ 2 − λ 3 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 6 − 3ν 5 − 3ν 7 − 7ν 8 ,
    3λ 1 + 3λ 2 − λ 4 − 5λ 3 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 6 − 3ν 5 − 3ν 7 − 7ν 8 ,
    3λ 1 + 3λ 3 − λ 2 − 5λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 6 − 3ν 5 − 3ν 7 − 7ν 8 ,
    3λ 1 + 3λ 2 − λ 3 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 5 − 3ν 6 − 3ν 8 − 7ν 7 ,
    3λ 1 + 3λ 2 − λ 4 − 5λ 3 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 5 − 3ν 6 − 3ν 8 − 7ν 7 ,
    3λ 1 + 3λ 3 − λ 2 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 2 + 5ν 3 + ν 1 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 7ν 8 ,
    3λ 2 + 3λ 3 − λ 1 − 5λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 2 + 5ν 3 + ν 1 + ν 4 + ν 5 − 3ν 6 − 3ν 7 − 7ν 8 ,
    3λ 2 + 3λ 3 − λ 1 − 5λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 3 + ν 2 + ν 4 + ν 6 − 3ν 5 − 3ν 7 − 7ν 8 ,
    3λ 2 + 3λ 3 − λ 1 − 5λ 4 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 5 + ν 6 − 3ν 4 − 3ν 7 − 7ν 8 ,
    3λ 1 + 3λ 3 − λ 2 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 6 − 3ν 5 − 3ν 8 − 7ν 7 ,
    3λ 1 + 3λ 3 − λ 2 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 3 + ν 2 + ν 4 + ν 5 − 3ν 6 − 3ν 8 − 7ν 7 ,
    3λ 1 + 3λ 3 − λ 4 − 5λ 2 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 8 − 3ν 5 − 3ν 6 − 7ν 7 ,
    3λ 1 + 3λ 4 − λ 3 − 5λ 2 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 8 − 3ν 5 − 3ν 6 − 7ν 7 ,
    3λ 2 + 3λ 3 − λ 1 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 5 + ν 6 − 3ν 4 − 3ν 8 − 7ν 7 ,
    3λ 2 + 3λ 3 − λ 1 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 3 + ν 2 + ν 4 + ν 6 − 3ν 5 − 3ν 8 − 7ν 7 ,
    3λ 2 + 3λ 3 − λ 1 − 5λ 4 + 2µ 2 − 2µ 1 ≤ 5ν 2 + 5ν 3 + ν 1 + ν 4 + ν 5 − 3ν 6 − 3ν 8 − 7ν 7 ,
    3λ 1 + 3λ 4 − λ 3 − 5λ 2 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 7 − 3ν 5 − 3ν 8 − 7ν 6 ,
    3λ 1 + 3λ 4 − λ 3 − 5λ 2 + 2µ 2 − 2µ 1 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 4 + ν 8 − 3ν 5 − 3ν 7 − 7ν 6 ,
    3λ 3 + 3λ 4 − λ 1 − 5λ 2 + 2µ 2 − 2µ 1 ≤ 5ν 2 + 5ν 3 + ν 4 + ν 5 + ν 6 − 3ν 1 − 3ν 7 − 7ν 8 ,
    3λ 3 + 3λ 4 − λ 2 − 5λ 1 + 2µ 1 − 2µ 2 ≤ 5ν 2 + 5ν 3 + ν 4 + ν 5 + ν 6 − 3ν 1 − 3ν 7 − 7ν 8 ,
    3λ 3 + 3λ 4 − λ 2 − 5λ 1 + 2µ 1 − 2µ 2 ≤ 5ν 1 + 5ν 2 + ν 3 + ν 6 + ν 7 − 3ν 4 − 3ν 8 − 7ν 5 .
    2λ 1 − 2λ 4 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 4 − ν 5 − ν 6 − ν 7 − 3ν 8 ,
    2λ 1 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 + ν 4 − ν 5 − ν 6 − ν 7 − 3ν 8 ,
    2λ 2 − 2λ 4 + µ 1 − µ 2 ≤ 3ν 2 + ν 1 + ν 3 + ν 4 − ν 5 − ν 6 − ν 7 − 3ν 8 ,
    2λ 1 − 2λ 3 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 5 − ν 4 − ν 6 − ν 7 − 3ν 8 ,
    2λ 2 − 2λ 4 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 5 − ν 4 − ν 6 − ν 7 − 3ν 8 ,
    2λ 1 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 + ν 4 − ν 5 − ν 6 − ν 8 − 3ν 7 ,
    2λ 1 − 2λ 3 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 4 − ν 5 − ν 6 − ν 8 − 3ν 7 ,
    2λ 3 − 2λ 4 + µ 1 − µ 2 ≤ 3ν 3 + ν 1 + ν 2 + ν 4 − ν 5 − ν 6 − ν 7 − 3ν 8 ,
    2λ 1 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 + ν 5 − ν 4 − ν 6 − ν 7 − 3ν 8 ,
    2λ 2 − 2λ 3 + µ 1 − µ 2 ≤ 3ν 2 + ν 1 + ν 3 + ν 5 − ν 4 − ν 6 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 4 + µ 1 − µ 2 ≤ 3ν 2 + ν 1 + ν 3 + ν 5 − ν 4 − ν 6 − ν 7 − 3ν 8 ,
    2λ 1 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 4 + ν 5 − ν 3 − ν 6 − ν 7 − 3ν 8 ,
    2λ 1 − 2λ 2 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 4 + ν 5 − ν 3 − ν 6 − ν 7 − 3ν 8 ,
    2λ 2 − 2λ 3 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 4 + ν 5 − ν 3 − ν 6 − ν 7 − 3ν 8 ,
    2λ 2 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 + ν 6 − ν 4 − ν 5 − ν 7 − 3ν 8 ,
    2λ 2 − 2λ 3 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 6 − ν 4 − ν 5 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 4 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 6 − ν 4 − ν 5 − ν 7 − 3ν 8 ,
    2λ 1 − 2λ 2 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 5 − ν 4 − ν 6 − ν 8 − 3ν 7 ,
    2λ 2 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 + ν 5 − ν 4 − ν 6 − ν 8 − 3ν 7 ,
    2λ 2 − 2λ 3 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 5 − ν 4 − ν 6 − ν 8 − 3ν 7 ,
    2λ 1 − 2λ 3 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 + ν 4 − ν 5 − ν 6 − ν 8 − 3ν 7 ,
    2λ 2 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 + ν 4 − ν 5 − ν 6 − ν 8 − 3ν 7 ,
    2λ 2 − 2λ 3 + µ 1 − µ 2 ≤ 3ν 2 + ν 1 + ν 3 + ν 4 − ν 5 − ν 6 − ν 8 − 3ν 7 ,
    2λ 1 − 2λ 2 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 4 − ν 5 − ν 7 − ν 8 − 3ν 6 ,
    2λ 1 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 4 + ν 5 − ν 3 − ν 6 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 + ν 6 − ν 4 − ν 5 − ν 8 − 3ν 7 ,
    2λ 1 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 + ν 5 − ν 4 − ν 6 − ν 8 − 3ν 7 ,
    2λ 3 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 + ν 5 − ν 4 − ν 6 − ν 8 − 3ν 7 ,
    2λ 3 − 2λ 4 + µ 2 − µ 1 ≤ 3ν 3 + ν 1 + ν 2 + ν 4 − ν 5 − ν 6 − ν 8 − 3ν 7 ,
    2λ 1 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 1 + ν 3 + ν 4 − ν 5 − ν 7 − ν 8 − 3ν 6 ,
    2λ 4 − 2λ 2 + µ 1 − µ 2 ≤ 3ν 4 + ν 1 + ν 2 + ν 5 − ν 3 − ν 6 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 3 + ν 1 + ν 4 + ν 5 − ν 2 − ν 6 − ν 7 − 3ν 8 ,
    2λ 4 − 2λ 2 + µ 1 − µ 2 ≤ 3ν 3 + ν 1 + ν 4 + ν 5 − ν 2 − ν 6 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 3 + ν 4 + ν 5 − ν 1 − ν 6 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 2 + ν 3 + ν 4 + ν 5 − ν 1 − ν 6 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 + ν 8 − ν 4 − ν 5 − ν 6 − 3ν 7 ,
    2λ 4 − 2λ 2 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 8 − ν 4 − ν 5 − ν 6 − 3ν 7 ,
    2λ 3 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 7 − ν 4 − ν 5 − ν 8 − 3ν 6 ,
    2λ 4 − 2λ 2 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 7 − ν 4 − ν 5 − ν 8 − 3ν 6 ,
    2λ 3 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 6 − ν 4 − ν 7 − ν 8 − 3ν 5 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 4 + ν 1 + ν 3 + ν 5 − ν 2 − ν 6 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 1 + µ 2 − µ 1 ≤ 3ν 3 + ν 2 + ν 4 + ν 5 − ν 1 − ν 6 − ν 7 − 3ν 8 ,
    2λ 4 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 3 + ν 2 + ν 4 + ν 5 − ν 1 − ν 6 − ν 7 − 3ν 8 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 3 + ν 2 + ν 4 + ν 5 − ν 1 − ν 6 − ν 7 − 3ν 8 ,
    2λ 4 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 2 + ν 3 + ν 4 + ν 6 − ν 1 − ν 5 − ν 7 − 3ν 8 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 2 + ν 3 + ν 4 + ν 6 − ν 1 − ν 5 − ν 7 − 3ν 8 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 3 + ν 1 + ν 4 + ν 6 − ν 2 − ν 5 − ν 7 − 3ν 8 ,
    2λ 3 − 2λ 1 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 4 + ν 8 − ν 3 − ν 5 − ν 6 − 3ν 7 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 4 + ν 8 − ν 3 − ν 5 − ν 6 − 3ν 7 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 3 + ν 1 + ν 4 + ν 5 − ν 2 − ν 6 − ν 8 − 3ν 7 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 4 + ν 1 + ν 2 + ν 5 − ν 3 − ν 6 − ν 8 − 3ν 7 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 4 + ν 7 − ν 3 − ν 5 − ν 8 − 3ν 6 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 2 + ν 1 + ν 3 + ν 7 − ν 4 − ν 5 − ν 8 − 3ν 6 ,
    2λ 3 − 2λ 1 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 + ν 8 − ν 4 − ν 5 − ν 7 − 3ν 6 ,
    2λ 4 − 2λ 2 + µ 2 − µ 1 ≤ 3ν 1 + ν 2 + ν 3 + ν 8 − ν 4 − ν 5 − ν 7 − 3ν 6 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 8 − ν 4 − ν 5 − ν 7 − 3ν 6 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 1 + ν 2 + ν 3 + ν 7 − ν 4 − ν 6 − ν 8 − 3ν 5 ,
    2λ 4 − 2λ 1 + µ 1 − µ 2 ≤ 3ν 2 + ν 1 + ν 3 + ν 6 − ν 4 − ν 7 − ν 8 − 3ν 5
    3λ 1 + λ 2 − λ 3 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 2 + λ 1 − λ 3 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 3 − λ 2 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 2 + λ 1 − λ 3 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 4 − 3λ 3 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 3 − λ 2 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 1 + λ 2 − λ 4 − 3λ 3 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 1 + λ 3 − λ 2 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 4 − 3λ 3 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 2 + λ 1 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 2 + λ 1 − λ 4 − 3λ 3 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 4 − 3λ 3 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 3 − λ 2 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 2 + λ 1 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 2 + λ 1 − λ 4 − 3λ 3 + µ 1 − µ 2 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 2 − λ 4 − 3λ 3 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 1 + λ 3 − λ 2 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 8 − 4ν 7 ,
    3λ 1 + λ 3 − λ 2 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 2 + λ 1 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 2 + λ 1 − λ 4 − 3λ 3 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 1 + λ 2 − λ 4 − 3λ 3 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 2 + λ 1 − λ 3 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 2 + λ 1 − λ 4 − 3λ 3 + µ 1 − µ 2 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 3 + 2ν 1 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 1 − λ 2 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 3 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 2 + 2ν 3 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 2 + λ 3 − λ 1 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 6 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 6 − 2ν 5 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 5 − 2ν 4 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 5 − 2ν 4 − 2ν 7 − 4ν 8
    3λ 1 + λ 4 − λ 2 − 3λ 3 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 3 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 4 − 2ν 3 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 3 − λ 4 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 6 − 4ν 7 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 6 − 4ν 7 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 8 − 4ν 6 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 3 + 2ν 2 + 2ν 4 − 2ν 6 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 5 − 2ν 4 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 6 − 2ν 4 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 5 − 2ν 3 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 4 − 2ν 3 − 2ν 7 − 4ν 8 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 5 − 2ν 6 − 4ν 7 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 5 − 2ν 4 − 2ν 8 − 4ν 7 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 6 − 2ν 5 − 2ν 8 − 4ν 7 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 3 + 2ν 4 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 3 + λ 2 − λ 1 − 3λ 4 + µ 2 − µ 1 ≤ 4ν 3 + 2ν 1 + 2ν 4 − 2ν 6 − 2ν 8 − 4ν 7 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 1 + 2ν 3 − 2ν 5 − 2ν 8 − 4ν 6 ,
    3λ 1 + λ 4 − λ 3 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 3 − 2ν 5 − 2ν 7 − 4ν 6 ,
    3λ 3 + λ 4 − λ 1 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 3 + 2ν 4 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 4 − λ 2 − 3λ 1 + µ 1 − µ 2 ≤ 4ν 2 + 2ν 3 + 2ν 4 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 4 − λ 1 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 5 − 2ν 6 − 4ν 7 ,
    3λ 4 + λ 3 − λ 1 − 3λ 2 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 5 − 2ν 6 − 4ν 7 ,
    3λ 4 + λ 3 − λ 2 − 3λ 1 + µ 1 − µ 2 ≤ 4ν 4 + 2ν 1 + 2ν 5 − 2ν 3 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 4 − λ 2 − 3λ 1 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 3 + 2ν 5 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 4 + λ 3 − λ 1 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 2 + 2ν 3 + 2ν 5 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 4 + λ 3 − λ 2 − 3λ 1 + µ 1 − µ 2 ≤ 4ν 2 + 2ν 3 + 2ν 5 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 4 − λ 2 − 3λ 1 + µ 2 − µ 1 ≤ 4ν 3 + 2ν 2 + 2ν 4 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 4 + λ 3 − λ 1 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 3 + 2ν 2 + 2ν 4 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 4 + λ 3 − λ 2 − 3λ 1 + µ 1 − µ 2 ≤ 4ν 3 + 2ν 2 + 2ν 4 − 2ν 1 − 2ν 7 − 4ν 8 ,
    3λ 3 + λ 4 − λ 2 − 3λ 1 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 4 − 2ν 6 − 4ν 7 ,
    3λ 4 + λ 3 − λ 1 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 4 − 2ν 6 − 4ν 7 ,
    3λ 4 + λ 3 − λ 2 − 3λ 1 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 4 − 2ν 6 − 4ν 7 ,
    3λ 3 + λ 4 − λ 2 − 3λ 1 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 5 − 2ν 7 − 4ν 6 ,
    3λ 4 + λ 3 − λ 1 − 3λ 2 + µ 2 − µ 1 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 5 − 2ν 7 − 4ν 6 ,
    3λ 4 + λ 3 − λ 2 − 3λ 1 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 8 − 2ν 5 − 2ν 7 − 4ν 6 ,
    3λ 4 + λ 3 − λ 2 − 3λ 1 + µ 1 − µ 2 ≤ 4ν 1 + 2ν 2 + 2ν 6 − 2ν 4 − 2ν 8 − 4ν 5 .""",
    (2, 2, 3, 12):
    u"""λ 1 − λ 2 ≤ ρ 1 + ρ 2 + ρ 3 + ρ 4 + ρ 5 + ρ 6 − ρ 7 − ρ 8 − ρ 9 − ρ 10 − ρ 11 − ρ 12 .
    2ν 1 − ν 2 − ν 3 ≤ 2ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − ρ 5 − ρ 6 − ρ 7 − ρ 8 − ρ 9 − ρ 10 − ρ 11 − ρ 12 .
    ν 1 + ν 2 − 2ν 3 ≤ ρ 1 + ρ 2 + ρ 3 + ρ 4 + ρ 5 + ρ 6 + ρ 7 + ρ 8 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 2ρ 12 .
    λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ρ 1 + 2ρ 2 + 2ρ 3 − 2ρ 10 − 2ρ 11 − 2ρ 12
    λ 1 − λ 2 + ν 1 − ν 3 ≤ 2ρ 1 + 2ρ 2 + ρ 3 + ρ 4 − ρ 9 − ρ 10 − 2ρ 11 − 2ρ 12 .
    3λ 1 − 3λ 2 + 2ν 1 − ν 2 − ν 3 ≤ 5ρ 1 + 5ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 11 − 4ρ 12 ,
    3λ 1 − 3λ 2 + 2ν 3 − ν 1 − ν 2 ≤ 5ρ 2 + 5ρ 3 + 2ρ 1 + 2ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 11 − 4ρ 12 ,
    3λ 1 − 3λ 2 + 2ν 3 − ν 1 − ν 2 ≤ 5ρ 1 + 5ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 + 2ρ 6 − ρ 8 − ρ 9 − 4ρ 7 − 4ρ 10 − 4ρ 11 − 4ρ 12 .
    3λ 1 − 3λ 2 + ν 1 + ν 2 − 2ν 3 ≤ 4ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 4 + ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 5ρ 11 − 5ρ 12 ,
    3λ 1 − 3λ 2 + ν 2 + ν 3 − 2ν 1 ≤ 4ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 6 + ρ 4 + ρ 5 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 5ρ 11 − 5ρ 12 ,
    3λ 1 − 3λ 2 + ν 2 + ν 3 − 2ν 1 ≤ 4ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 4 + ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 12 − 5ρ 10 − 5ρ 11
    λ 1 − λ 2 + µ 1 − µ 2 + 2ν 1 − 2ν 3 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 1 − µ 2 + 2ν 2 − 2ν 3 ≤ 4ρ 2 + 2ρ 1 + 2ρ 3 + 2ρ 4 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 1 − 2ν 3 ≤ 4ρ 2 + 2ρ 1 + 2ρ 3 + 2ρ 4 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 1 − µ 2 + 2ν 1 − 2ν 2 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 5 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 1 − µ 2 + 2ν 2 − 2ν 3 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − 2ρ 8 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 1 − µ 2 + 2ν 1 − 2ν 2 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − 2ρ 9 − 2ρ 10 − 2ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 1 − 2ν 3 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − 2ρ 9 − 2ρ 10 − 2ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 2 − 2ν 3 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − 2ρ 8 − 2ρ 10 − 2ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 1 − 2ν 2 ≤ 4ρ 2 + 2ρ 1 + 2ρ 3 + 2ρ 5 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 1 − 2ν 2 ≤ 4ρ 2 + 2ρ 1 + 2ρ 3 + 2ρ 4 − 2ρ 9 − 2ρ 10 − 2ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 2 − 2ν 3 ≤ 4ρ 2 + 2ρ 1 + 2ρ 3 + 2ρ 4 − 2ρ 9 − 2ρ 10 − 2ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 1 − 2ν 2 ≤ 4ρ 1 + 2ρ 2 + 2ρ 4 + 2ρ 5 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 2 − 2ν 3 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − 2ρ 8 − 2ρ 9 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 3 − 2ν 1 ≤ 4ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 9 − 2ρ 10 − 2ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + µ 2 − µ 1 + 2ν 3 − 2ν 1 ≤ 4ρ 1 + 2ρ 2 + 2ρ 3 + 2ρ 4 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 4ρ 11
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 4ν 1 − 2ν 2 − 2ν 3 ≤ 10ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 8ρ 11 − 8ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 4ν 2 − 2ν 1 − 2ν 3 ≤ 10ρ 2 + 4ρ 1 + 4ρ 3 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 8ρ 11 − 8ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 2 − 3µ 1 + 4ν 1 − 2ν 2 − 2ν 3 ≤ 10ρ 2 + 4ρ 1 + 4ρ 3 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 8ρ 11 − 8ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 4ν 2 − 2ν 1 − 2ν 3 ≤ 10ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 11 − 8ρ 10 − 8ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 4ν 3 − 2ν 1 − 2ν 2 ≤ 10ρ 3 + 4ρ 1 + 4ρ 2 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 8ρ 11 − 8ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 4ν 3 − 2ν 1 − 2ν 2 ≤ 10ρ 2 + 4ρ 1 + 4ρ 3 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 11 − 8ρ 10 − 8ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 4ν 3 − 2ν 1 − 2ν 2 ≤ 10ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 5 + 4ρ 6 − 2ρ 4 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 10 − 8ρ 11 − 8ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 4ν 3 − 2ν 1 − 2ν 2 ≤ 10ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 12 − 8ρ 10 − 8ρ 11 ,
    3λ 1 − 3λ 2 + 3µ 2 − 3µ 1 + 4ν 2 − 2ν 1 − 2ν 3 ≤ 10ρ 1 + 4ρ 2 + 4ρ 3 + 4ρ 4 + 4ρ 5 − 2ρ 6 − 2ρ 7 − 2ρ 8 − 2ρ 9 − 2ρ 12 − 8ρ 10 − 8ρ 11 .
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 2ν 1 + 2ν 2 − 4ν 3 ≤ 8ρ 1 + 8ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 11 − 10ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 2ν 1 + 2ν 3 − 4ν 2 ≤ 8ρ 1 + 8ρ 3 + 2ρ 2 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 11 − 10ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 2ν 1 + 2ν 3 − 4ν 2 ≤ 8ρ 1 + 8ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 12 − 10ρ 11 ,
    3λ 1 − 3λ 2 + 3µ 2 − 3µ 1 + 2ν 1 + 2ν 2 − 4ν 3 ≤ 8ρ 1 + 8ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 12 − 10ρ 11 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 2ν 2 + 2ν 3 − 4ν 1 ≤ 8ρ 1 + 8ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 9 − 4ρ 7 − 4ρ 8 − 4ρ 10 − 4ρ 11 − 10ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 2ν 2 + 2ν 3 − 4ν 1 ≤ 8ρ 2 + 8ρ 3 + 2ρ 1 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 11 − 10ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 2 − 3µ 1 + 2ν 1 + 2ν 3 − 4ν 2 ≤ 8ρ 2 + 8ρ 3 + 2ρ 1 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 11 − 10ρ 12 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 2ν 2 + 2ν 3 − 4ν 1 ≤ 8ρ 1 + 8ρ 3 + 2ρ 2 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 10 − 4ρ 12 − 10ρ 11 ,
    3λ 1 − 3λ 2 + 3µ 1 − 3µ 2 + 2ν 2 + 2ν 3 − 4ν 1 ≤ 8ρ 1 + 8ρ 2 + 2ρ 3 + 2ρ 4 + 2ρ 5 + 2ρ 6 + 2ρ 7 − 4ρ 8 − 4ρ 9 − 4ρ 11 − 4ρ 12 − 10ρ 10
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 2ν 1 − ν 2 − ν 3 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − ν 1 − ν 3 ≤ 11ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − ν 1 − ν 3 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 5 + 2ρ 4 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − ν 1 − ν 3 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 8 − 4ρ 7 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − ν 1 − ν 3 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 11 − 10ρ 10 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 9 − 4ρ 7 − 4ρ 8 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 3 + 8ρ 1 + 8ρ 2 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 5 + 2ρ 4 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 8 − 4ρ 7 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 11 − 10ρ 10 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 6 + 2ρ 4 + 2ρ 5 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 5 + 2ρ 4 + 2ρ 6 − ρ 8 − 4ρ 7 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 5 + 2ρ 4 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 11 − 10ρ 10 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 8 − 4ρ 7 − 4ρ 9 − 7ρ 11 − 10ρ 10 − 10ρ 12 ,
    6λ 1 − 6λ 2 − 3µ 2 + 3µ 1 + 2ν 3 − ν 1 − ν 2 ≤ 11ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 12 − 10ρ 10 − 10ρ 11 .
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 1 + ν 2 − 2ν 3 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 1 + ν 3 − 2ν 2 ≤ 10ρ 1 + 10ρ 3 + 7ρ 2 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 1 + ν 3 − 2ν 2 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 6 + ρ 5 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 1 + ν 3 − 2ν 2 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 9 − 5ρ 8 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 1 + ν 3 − 2ν 2 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 11ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 9 − 5ρ 8 − 8ρ 10 − 8ρ 12 − 11ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 2 + 10ρ 3 + 7ρ 1 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 3 + 7ρ 2 + 4ρ 4 + 4ρ 6 + ρ 5 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 3 + 7ρ 2 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 9 − 5ρ 8 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 3 + 7ρ 2 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 11ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 5 + 4ρ 6 + ρ 4 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 6 + ρ 5 − 2ρ 7 − 2ρ 9 − 5ρ 8 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 6 + ρ 5 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 11ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 8 − 2ρ 9 − 5ρ 7 − 8ρ 10 − 8ρ 11 − 11ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + ν 2 + ν 3 − 2ν 1 ≤ 10ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 11 − 8ρ 12 − 11ρ 10 .
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 1 + ν 2 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 2 + 10ρ 1 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 4 + 4ρ 3 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 7 − 2ρ 6 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 10 − 8ρ 9 − 8ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 1 + ν 3 − 5ν 2 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 4ν 1 + ν 2 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 2 + 10ρ 1 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 4 + 4ρ 3 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 6 + ρ 7 − 2ρ 5 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 7 − 2ρ 6 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 4ν 2 + ν 1 − 5ν 3 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 10 − 8ρ 9 − 8ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 3 + ν 2 − 5ν 1 ≤ 13ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 11 − 8ρ 9 − 8ρ 12 − 14ρ 10 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 4ν 3 + ν 2 − 5ν 1 ≤ 13ρ 2 + 10ρ 3 + 7ρ 4 + 4ρ 1 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 4ν 3 + ν 1 − 5ν 2 ≤ 13ρ 2 + 10ρ 3 + 7ρ 4 + 4ρ 1 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 8ρ 11 − 14ρ 12
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 1 − ν 2 − 4ν 3 ≤ 14ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 2 − ν 1 − 4ν 3 ≤ 14ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 − ν 2 − 4ν 3 ≤ 14ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 1 + 8ρ 2 + 8ρ 4 + 5ρ 3 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 7 − ρ 6 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 10 − 7ρ 9 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 12 − 13ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 2 + 8ρ 1 + 8ρ 4 + 5ρ 3 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 7 − ρ 6 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 10 − 7ρ 9 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 2 + 8ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 12 − 13ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 − ν 3 − 4ν 2 ≤ 14ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 8 − ρ 6 − 4ρ 7 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 3 − ν 2 − 4ν 1 ≤ 14ρ 3 + 8ρ 1 + 8ρ 4 + 5ρ 2 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 13ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 3 − ν 2 − 4ν 1 ≤ 14ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 12 − 7ρ 9 − 10ρ 10 − 13ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 2 − ν 3 − 4ν 1 ≤ 14ρ 1 + 8ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 12 − 7ρ 9 − 10ρ 10 − 13ρ 11 .
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 7ν 1 − 2ν 2 − 5ν 3 ≤ 16ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 2 − 5ν 3 ≤ 16ρ 2 + 10ρ 1 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 1 + 10ρ 2 + 7ρ 4 + 4ρ 3 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 2 − 5ν 3 ≤ 16ρ 1 + 10ρ 2 + 7ρ 4 + 4ρ 3 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 7 − 2ρ 6 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 10 − 8ρ 9 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 2 − 5ν 3 ≤ 16ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 10 − 8ρ 9 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 2 − 5ν 3 ≤ 16ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 2 + 10ρ 1 + 7ρ 4 + 4ρ 3 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 2 + 10ρ 1 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 7 − 2ρ 6 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 2 + 10ρ 1 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 10 − 8ρ 9 − 11ρ 11 − 14ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 2 + 10ρ 1 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 6 − 2ρ 7 − 2ρ 8 − 5ρ 9 − 8ρ 10 − 11ρ 12 − 14ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 7ν 1 − 2ν 3 − 5ν 2 ≤ 16ρ 1 + 10ρ 2 + 7ρ 3 + 4ρ 4 + 4ρ 5 + ρ 8 − 2ρ 6 − 2ρ 7 − 5ρ 9 − 8ρ 10 − 11ρ 11 − 14ρ 12 .
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 1 + 2ν 2 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 2 + 11ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 + 2ν 2 − 7ν 3 ≤ 14ρ 2 + 11ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 4 + 5ρ 3 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 + 2ν 2 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 4 + 5ρ 3 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 7 − ρ 6 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 1 − 3µ 2 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 10 − 7ρ 9 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 + 2ν 2 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 10 − 7ρ 9 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 1 + 2ν 2 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 12 − 16ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 2 + 11ρ 1 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 12 − 16ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 4 + 5ρ 3 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 12 − 16ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 6 + 2ρ 7 − ρ 5 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 11 − 16ρ 12 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 7 − ρ 6 − 4ρ 8 − 4ρ 9 − 7ρ 10 − 10ρ 12 − 16ρ 11 ,
    6λ 1 − 6λ 2 + 3µ 2 − 3µ 1 + 5ν 2 + 2ν 1 − 7ν 3 ≤ 14ρ 1 + 11ρ 2 + 8ρ 3 + 5ρ 4 + 2ρ 5 + 2ρ 6 − ρ 7 − 4ρ 8 − 4ρ 10 − 7ρ 9 − 10ρ 12 − 16ρ 11
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 1 − ν 3 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 3 ≤ 4ρ 2 + 3ρ 1 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 1 − ν 2 ≤ 4ρ 1 + 3ρ 3 + 2ρ 2 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 3 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 5 + ρ 4 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 1 − ν 2 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 6 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 3 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 7 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 1 − ν 2 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 9 − 2ρ 8 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 3 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 11 − 3ρ 10 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 1 − ν 2 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 − 2µ 2 + 2µ 1 + ν 3 − ν 2 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 7 − 2ρ 8 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 − 2µ 2 + 2µ 1 + ν 3 − ν 2 ≤ 4ρ 3 + 3ρ 1 + 2ρ 2 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 1 ≤ 4ρ 2 + 3ρ 3 + 2ρ 1 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 2 − λ 1 + 2µ 1 − 2µ 2 + ν 1 − ν 2 ≤ 4ρ 2 + 3ρ 3 + 2ρ 1 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 − 2µ 2 + 2µ 1 + ν 3 − ν 2 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 6 + ρ 4 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 2 − λ 1 + 2µ 1 − 2µ 2 + ν 2 − ν 3 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 6 + ρ 4 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 5 + ρ 6 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 9 − 2ρ 7 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 2 − λ 1 + 2µ 1 − 2µ 2 + ν 1 − ν 2 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 9 − 2ρ 7 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 − 2µ 2 + 2µ 1 + ν 3 − ν 2 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 12 − 3ρ 10 − 4ρ 11 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 12 − 3ρ 11 − 4ρ 10 ,
    λ 2 − λ 1 + 2µ 1 − 2µ 2 + ν 2 − ν 3 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 12 − 3ρ 10 − 4ρ 11 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 2 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 11 − 3ρ 12 − 4ρ 10 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 7 − 2ρ 9 − 2ρ 11 − 3ρ 12 − 4ρ 10 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 5 + ρ 6 − ρ 8 − 2ρ 9 − 2ρ 11 − 3ρ 10 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 6 − ρ 7 − 2ρ 8 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 5 + ρ 6 − ρ 7 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 9 − 2ρ 7 − 2ρ 11 − 3ρ 10 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 9 − 2ρ 8 − 2ρ 12 − 3ρ 10 − 4ρ 11 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 6 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 6 + ρ 4 − ρ 9 − 2ρ 8 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 6 − ρ 8 − 2ρ 9 − 2ρ 12 − 3ρ 10 − 4ρ 11 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 2 + 3ρ 3 + 2ρ 1 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 11 − 3ρ 10 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 6 + ρ 4 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 7 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 5 + ρ 4 − ρ 9 − 2ρ 7 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 3 + 3ρ 2 + 2ρ 1 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 3 + 3ρ 1 + 2ρ 2 + 2ρ 4 + ρ 6 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 3 + 3ρ 1 + 2ρ 2 + 2ρ 4 + ρ 5 − ρ 9 − 2ρ 8 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 3 + 3ρ 1 + 2ρ 2 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 2 + 3ρ 1 + 2ρ 3 + 2ρ 5 + ρ 6 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 2 + 3ρ 1 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 9 − 2ρ 7 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 2 + 3ρ 1 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 11 − 3ρ 12 − 4ρ 10 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 2 + 3ρ 3 + 2ρ 1 + 2ρ 5 + ρ 4 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 2 + 3ρ 3 + 2ρ 1 + 2ρ 4 + ρ 5 − ρ 7 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 3 + 2ρ 2 + 2ρ 6 + ρ 4 − ρ 8 − 2ρ 9 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 5 + ρ 4 − ρ 8 − 2ρ 9 − 2ρ 11 − 3ρ 12 − 4ρ 10 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 3 + 2ρ 2 + 2ρ 4 + ρ 5 − ρ 7 − 2ρ 8 − 2ρ 10 − 3ρ 11 − 4ρ 12 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 2 + 2ρ 3 + 2ρ 4 + ρ 5 − ρ 7 − 2ρ 8 − 2ρ 10 − 3ρ 12 − 4ρ 11 ,
    λ 1 − λ 2 + 2µ 1 − 2µ 2 + ν 3 − ν 1 ≤ 4ρ 1 + 3ρ 3 + 2ρ 2 + 2ρ 4 + ρ 5 − ρ 8 − 2ρ 9 − 2ρ 12 − 3ρ 10 − 4ρ 11 .
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 3 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 4 + 2ρ 3 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 4 + 2ρ 3 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 4 + 2ρ 3 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 10 − 4ρ 9 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 10 − 4ρ 9 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 10 − 4ρ 9 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 2 + 4ρ 1 + 4ρ 4 + 2ρ 3 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 10 − 4ρ 9 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 4 + 2ρ 3 + 2ρ 6 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 4 + 2ρ 3 + 2ρ 5 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 4 + 2ρ 3 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 8 − 2ρ 10 − 4ρ 9 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 7 − 2ρ 10 − 4ρ 9 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 1 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 + 3µ 1 − 3µ 2 + 2ν 2 − 2ν 3 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 10 − 4ρ 9 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 12 − 4ρ 9 − 4ρ 11 − 6ρ 10 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 7 − 2ρ 10 − 4ρ 8 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 6 + 2ρ 3 + 2ρ 4 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 2 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 6 + 2ρ 3 + 2ρ 4 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 5 + 2ρ 3 + 2ρ 6 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 3 + 4ρ 1 + 4ρ 4 + 2ρ 2 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 9 − 2ρ 10 − 4ρ 7 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 2 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 9 − 2ρ 10 − 4ρ 7 − 4ρ 11 − 6ρ 12 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 12 − 4ρ 9 − 4ρ 10 − 6ρ 11 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 2 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 12 − 4ρ 9 − 4ρ 10 − 6ρ 11 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 11 − 4ρ 9 − 4ρ 12 − 6ρ 10 ,
    λ 1 − λ 2 + 3µ 1 − 3µ 2 + 2ν 3 − 2ν 1 ≤ 6ρ 2 + 4ρ 3 + 4ρ 4 + 2ρ 1 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 2 ≤ 6ρ 2 + 4ρ 3 + 4ρ 4 + 2ρ 1 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 6 − 2ρ 8 − 2ρ 12 − 4ρ 9 − 4ρ 10 − 6ρ 11 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 2 + 4ρ 1 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 9 − 2ρ 10 − 4ρ 7 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 6 + 2ρ 3 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 6 + 2ρ 3 + 2ρ 4 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 12 − 6ρ 11 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 2 + 4ρ 3 + 4ρ 4 + 2ρ 1 + 2ρ 5 − 2ρ 7 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 1 + 4ρ 2 + 4ρ 3 + 2ρ 4 + 2ρ 5 − 2ρ 8 − 2ρ 10 − 4ρ 7 − 4ρ 11 − 6ρ 12 ,
    λ 2 − λ 1 − 3µ 2 + 3µ 1 + 2ν 3 − 2ν 1 ≤ 6ρ 3 + 4ρ 2 + 4ρ 4 + 2ρ 1 + 2ρ 5 − 2ρ 8 − 2ρ 9 − 4ρ 10 − 4ρ 11 − 6ρ 12 .""",
    (3, 3, 9):
    u"""2λ 1 − λ 2 − λ 3 ≤ 2ν 1 + 2ν 2 + 2ν 3 − ν 4 − ν 5 − ν 6 − ν 7 − ν 8 − ν 9 ,
    λ 1 + λ 2 − 2λ 3 ≤ ν 1 + ν 2 + ν 3 + ν 4 + ν 5 + ν 6 − 2ν 7 − 2ν 8 − 2ν 9 ,
    λ 1 + λ 2 − 2λ 3 + µ 1 + µ 2 − 2µ 3 ≤ 2ν 1 + 2ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 7 − ν 8 − 4ν 9 ,
    λ 1 + λ 2 − 2λ 3 + µ 1 + µ 3 − 2µ 2 ≤ 2ν 1 + 2ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 7 − ν 9 − 4ν 8 ,
    λ 1 + λ 2 − 2λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 2ν 1 + 2ν 2 + 2ν 3 + 2ν 6 − ν 4 − ν 5 − ν 7 − ν 8 − 4ν 9 ,
    λ 1 + λ 2 − 2λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 2ν 1 + 2ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 8 − ν 9 − 4ν 7 ,
    2λ 1 − λ 2 − λ 3 + 2µ 1 − µ 2 − µ 3 ≤ 4ν 1 + ν 2 + ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 8 − 2ν 9 ,
    2λ 1 − λ 2 − λ 3 + 2µ 2 − µ 1 − µ 3 ≤ 4ν 2 + ν 1 + ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 8 − 2ν 9 ,
    2λ 1 − λ 2 − λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 4ν 3 + ν 1 + ν 2 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 8 − 2ν 9 ,
    2λ 1 − λ 2 − λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 4ν 1 + ν 2 + ν 3 + ν 5 + ν 6 − 2ν 4 − 2ν 7 − 2ν 8 − 2ν 9
    λ 1 + λ 2 − 2λ 3 + 2µ 1 − µ 2 − µ 3 ≤ 3ν 1 + 3ν 2 − 3ν 8 − 3ν 9 ,
    λ 1 + λ 3 − 2λ 2 + 2µ 1 − µ 2 − µ 3 ≤ 3ν 1 + 3ν 3 − 3ν 8 − 3ν 9 ,
    λ 1 + λ 2 − 2λ 3 + 2µ 2 − µ 1 − µ 3 ≤ 3ν 1 + 3ν 2 − 3ν 7 − 3ν 9 ,
    λ 2 + λ 3 − 2λ 1 + 2µ 1 − µ 2 − µ 3 ≤ 3ν 2 + 3ν 3 − 3ν 8 − 3ν 9 ,
    λ 1 + λ 3 − 2λ 2 + 2µ 2 − µ 1 − µ 3 ≤ 3ν 2 + 3ν 3 − 3ν 8 − 3ν 9 ,
    λ 1 + λ 2 − 2λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 3ν 2 + 3ν 3 − 3ν 8 − 3ν 9 ,
    λ 2 + λ 3 − 2λ 1 + 2µ 1 − µ 2 − µ 3 ≤ 3ν 1 + 3ν 2 − 3ν 7 − 3ν 8 ,
    λ 1 + λ 3 − 2λ 2 + 2µ 2 − µ 1 − µ 3 ≤ 3ν 1 + 3ν 2 − 3ν 7 − 3ν 8 ,
    λ 1 + λ 2 − 2λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 3ν 1 + 3ν 2 − 3ν 7 − 3ν 8
    λ 1 − λ 3 + µ 1 − µ 3 ≤ 2ν 1 + ν 2 + ν 3 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 1 + ν 3 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 2 + µ 1 − µ 2 ≤ 2ν 1 + ν 2 + ν 5 − ν 7 − ν 8 − 2ν 9 ,
    λ 2 − λ 3 + µ 2 − µ 3 ≤ 2ν 1 + ν 2 + ν 3 − ν 5 − ν 8 − 2ν 9 ,
    λ 2 − λ 3 + µ 2 − µ 3 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 7 − 2ν 9 ,
    λ 1 − λ 3 + µ 2 − µ 3 ≤ 2ν 2 + ν 1 + ν 3 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 3 + µ 2 − µ 3 ≤ 2ν 1 + ν 2 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 3 + µ 2 − µ 3 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 8 − 2ν 9 ,
    λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + ν 2 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 8 − 2ν 9 ,
    λ 1 − λ 3 + µ 1 − µ 2 ≤ 2ν 1 + ν 2 + ν 3 − ν 7 − ν 9 − 2ν 8 ,
    λ 1 − λ 2 + µ 2 − µ 3 ≤ 2ν 2 + ν 1 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 2 + µ 2 − µ 3 ≤ 2ν 2 + ν 1 + ν 3 − ν 6 − ν 8 − 2ν 9 ,
    λ 1 − λ 2 + µ 2 − µ 3 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 9 − 2ν 8 ,
    λ 1 − λ 2 + µ 2 − µ 3 ≤ 2ν 1 + ν 2 + ν 4 − ν 7 − ν 9 − 2ν 8 ,
    λ 1 − λ 2 + µ 2 − µ 3 ≤ 2ν 2 + ν 1 + ν 3 − ν 7 − ν 9 − 2ν 8 ,
    λ 1 − λ 2 + µ 2 − µ 1 ≤ 2ν 2 + ν 3 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 2 + µ 2 − µ 1 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 7 − 2ν 8 ,
    λ 2 − λ 3 + µ 3 − µ 2 ≤ 2ν 2 + ν 3 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 2 − λ 3 + µ 3 − µ 2 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 7 − 2ν 8 ,
    λ 1 − λ 3 + µ 3 − µ 1 ≤ 2ν 3 + ν 1 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 3 + µ 3 − µ 1 ≤ 2ν 2 + ν 3 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 3 + µ 3 − µ 1 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 7 − 2ν 8 ,
    λ 1 − λ 3 + µ 3 − µ 1 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 9 − 2ν 7 ,
    λ 1 − λ 2 + µ 3 − µ 2 ≤ 2ν 3 + ν 1 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 2 − λ 3 + µ 2 − µ 1 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 9 − 2ν 7 ,
    λ 1 − λ 2 + µ 3 − µ 1 ≤ 2ν 3 + ν 2 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 2 + µ 3 − µ 1 ≤ 2ν 3 + ν 1 + ν 5 − ν 7 − ν 8 − 2ν 9 ,
    λ 1 − λ 2 + µ 3 − µ 1 ≤ 2ν 2 + ν 1 + ν 3 − ν 6 − ν 7 − 2ν 8 ,
    λ 1 − λ 2 + µ 3 − µ 1 ≤ 2ν 2 + ν 3 + ν 4 − ν 7 − ν 9 − 2ν 8 ,
    λ 1 − λ 2 + µ 3 − µ 1 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 8 − 2ν 7 ,
    λ 2 − λ 3 + µ 3 − µ 1 ≤ 2ν 3 + ν 2 + ν 4 − ν 7 − ν 8 − 2ν 9 ,
    λ 2 − λ 3 + µ 3 − µ 1 ≤ 2ν 2 + ν 1 + ν 3 − ν 6 − ν 7 − 2ν 8 ,
    λ 2 − λ 3 + µ 3 − µ 1 ≤ 2ν 2 + ν 3 + ν 4 − ν 7 − ν 9 − 2ν 8 ,
    λ 2 − λ 3 + µ 3 − µ 1 ≤ 2ν 1 + ν 2 + ν 3 − ν 5 − ν 9 − 2ν 7 ,
    λ 2 − λ 3 + µ 3 − µ 1 ≤ 2ν 1 + ν 2 + ν 3 − ν 6 − ν 8 − 2ν 7 .
    3λ 1 − 3λ 3 + µ 1 + µ 2 − 2µ 3 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 3 + µ 1 + µ 3 − 2µ 2 ≤ 4ν 1 + 4ν 3 + ν 2 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 3 + µ 1 + µ 3 − 2µ 2 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 2 − 3λ 3 + µ 1 + µ 2 − 2µ 3 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 3 + µ 1 + µ 3 − 2µ 2 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 1 − 3λ 2 + µ 1 + µ 2 − 2µ 3 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 1 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 2 + 4ν 3 + ν 1 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 2 − 3λ 3 + µ 1 + µ 3 − 2µ 2 ≤ 4ν 2 + 4ν 3 + ν 1 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 1 + 4ν 3 + ν 2 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 5 + ν 6 − 2ν 4 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 2 + µ 1 + µ 3 − 2µ 2 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 5 + ν 6 − 2ν 4 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 2 − 3λ 3 + µ 1 + µ 3 − 2µ 2 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 1 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 1 + 4ν 3 + ν 2 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 1 − 3λ 2 + µ 1 + µ 3 − 2µ 2 ≤ 4ν 1 + 4ν 3 + ν 2 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 1 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 8 − 2ν 9 − 5ν 7 ,
    3λ 1 − 3λ 2 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 1 + 4ν 3 + ν 2 + ν 5 + ν 6 − 2ν 4 − 2ν 7 − 2ν 8 − 5ν 9 ,
    3λ 1 − 3λ 2 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 2 + 4ν 3 + ν 1 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 2 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 2 + 4ν 3 + ν 1 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 2ν 9 − 5ν 8 ,
    3λ 2 − 3λ 3 + µ 2 + µ 3 − 2µ 1 ≤ 4ν 1 + 4ν 2 + ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 8 − 2ν 9 − 5ν 7 .
    3λ 1 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 9 − 4ν 7 − 4ν 8 ,
    3λ 1 − 3λ 2 + 2µ 2 − µ 1 − µ 3 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 9 − 4ν 7 − 4ν 8 ,
    3λ 2 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 6 − ν 4 − ν 5 − ν 8 − 4ν 7 − 4ν 9 ,
    3λ 1 − 3λ 2 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 9 − 4ν 7 − 4ν 8 ,
    3λ 2 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 9 − 4ν 7 − 4ν 8 ,
    3λ 1 − 3λ 3 + 2µ 1 − µ 2 − µ 3 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 2 − µ 1 − µ 3 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 2 − 3λ 3 + 2µ 1 − µ 2 − µ 3 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 2 − µ 1 − µ 3 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 2 + 2µ 1 − µ 2 − µ 3 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 2 − µ 1 − µ 3 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 8 − 4ν 7 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 3 + 2ν 1 + 2ν 2 + 2ν 4 − ν 5 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 2 + 2µ 2 − µ 1 − µ 3 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 6 − ν 4 − ν 5 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 2 − 3λ 3 + 2µ 2 − µ 1 − µ 3 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 6 − ν 4 − ν 5 − ν 7 − 4ν 8 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 1 + 2ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − ν 8 − 4ν 7 − 4ν 9 ,
    3λ 1 − 3λ 3 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 8 − 4ν 7 − 4ν 9 ,
    3λ 2 − 3λ 3 + 2µ 2 − µ 1 − µ 3 ≤ 5ν 2 + 2ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − ν 8 − 4ν 7 − 4ν 9 ,
    3λ 1 − 3λ 2 + 2µ 3 − µ 1 − µ 2 ≤ 5ν 3 + 2ν 1 + 2ν 2 + 2ν 5 − ν 4 − ν 6 − ν 7 − 4ν 8 − 4ν 9
    3λ 1 − 3λ 3 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 1 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 1 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 1 − 3λ 2 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 1 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 1 − 3λ 2 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 8 − 5ν 7 − 8ν 9 ,
    3λ 1 − 3λ 2 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 5ν 9 − 8ν 8 ,
    3λ 1 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 6 − 2ν 5 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 1 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 8 − 5ν 7 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 8 − 5ν 7 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 8 − 5ν 7 − 8ν 9 ,
    3λ 2 − 3λ 3 + 4µ 1 + µ 3 − 5µ 2 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 3 − 3λ 2 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 1 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 7 − 5ν 9 − 8ν 8 ,
    3λ 1 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 7 − 5ν 9 − 8ν 8 ,
    3λ 1 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 7 − 5ν 9 − 8ν 8 ,
    3λ 2 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 3 + 4ν 1 + 4ν 4 + ν 2 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 3 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 3 + 4ν 4 + ν 1 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 2 + 4ν 3 + 4ν 4 + ν 1 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 2 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 6 + ν 3 + ν 4 − 2ν 5 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 6 + ν 3 + ν 4 − 2ν 5 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 5 + ν 3 + ν 6 − 2ν 4 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 3 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 3 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 3 − 3λ 2 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 2 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 2 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 2 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 1 + µ 2 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 9 − 5ν 8 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 3 + 4ν 2 + 4ν 4 + ν 1 + ν 5 − 2ν 6 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 6 + ν 3 + ν 5 − 2ν 4 − 2ν 7 − 5ν 8 − 8ν 9 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 6 + ν 3 + ν 4 − 2ν 5 − 2ν 8 − 5ν 7 − 8ν 9 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 9 − 5ν 7 − 8ν 8 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 3 + 4ν 4 + ν 1 + ν 5 − 2ν 6 − 2ν 7 − 5ν 9 − 8ν 8 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 6 − 2ν 5 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 8 − 5ν 9 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 3 + ν 4 + ν 6 − 2ν 5 − 2ν 9 − 5ν 8 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 1 + 4ν 2 + 4ν 4 + ν 3 + ν 5 − 2ν 6 − 2ν 9 − 5ν 8 − 8ν 7 ,
    3λ 3 − 3λ 1 + 4µ 2 + µ 1 − 5µ 3 ≤ 7ν 2 + 4ν 1 + 4ν 3 + ν 4 + ν 5 − 2ν 6 − 2ν 9 − 5ν 8 − 8ν 7
    3λ 1 − 3λ 3 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 2 + 5ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 3 + 2ν 2 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 2 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 2 + 5µ 2 − µ 1 − 4µ 3 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 3 + 2ν 2 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 1 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 3 + 2ν 2 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 9 − 7ν 8 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 1 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 3 + 2ν 2 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 2 − 3λ 3 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 3 + 5ν 2 + 2ν 1 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9
    3λ 2 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 6 − ν 4 − ν 7 − 4ν 5 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 5 − ν 6 − ν 7 − 4ν 4 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 5 − ν 6 − ν 7 − 4ν 4 − 4ν 8 − 7ν 9 ,
    3λ 2 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 9 − 4ν 6 − 4ν 7 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 9 − 4ν 6 − 4ν 7 − 7ν 8 ,
    3λ 2 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 2 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 2 − 4µ 3 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 8 − 4ν 6 − 4ν 9 − 7ν 7 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 2 + 2ν 1 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 5 − ν 4 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 2 + 2ν 1 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 6 − ν 5 − ν 7 − 4ν 4 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 3 + 2ν 2 + 2ν 5 − ν 6 − ν 7 − 4ν 4 − 4ν 8 − 7ν 9 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 1 + 2ν 3 + 2ν 4 − ν 5 − ν 9 − 4ν 6 − 4ν 7 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 4 − ν 5 − ν 7 − 4ν 6 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 1 + 2ν 2 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 2 + 5ν 3 + 2ν 1 + 2ν 5 − ν 4 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 3 + 5ν 2 + 2ν 1 + 2ν 4 − ν 5 − ν 6 − 4ν 7 − 4ν 9 − 7ν 8 ,
    3λ 3 − 3λ 1 + 5µ 1 − µ 3 − 4µ 2 ≤ 8ν 1 + 5ν 2 + 2ν 3 + 2ν 4 − ν 5 − ν 9 − 4ν 6 − 4ν 8 − 7ν 7""",
    (2, 2, 2, 2, 16):
    u"""# QUBIT_COORDS 0 1 2 3

    2ρ ≤ τ 1 + τ 2 + τ 3 + τ 4 + τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − τ 12 − τ 13 − τ 14 − τ 15 − τ 16 ,
    2ν + 2ρ ≤ 2τ 1 + 2τ 2 + 2τ 3 + 2τ 4 − 2τ 13 − 2τ 14 − 2τ 15 − 2τ 16 ,
    2µ + 2ν + 2ρ ≤ 3τ 1 + 3τ 2 + τ 3 + τ 4 + τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − τ 12 − τ 13 − τ 14 − 3τ 15 − 3τ 16 ,
    2µ + 2ν + 4ρ ≤ 4τ 1 + 4τ 2 + 2τ 3 + 2τ 4 + 2τ 5 + 2τ 6 − 2τ 11 − 2τ 12 − 2τ 13 − 2τ 14 − 4τ 15 − 4τ 16 ,
    2λ + 2µ + 2ν + 2ρ ≤ 4τ 1 + 2τ 2 + 2τ 3 + 2τ 4 + 2τ 5 − 2τ 12 − 2τ 13 − 2τ 14 − 2τ 15 − 4τ 16 ,
    2λ + 2µ + 2ν − 2ρ ≤ 4τ 2 + 2τ 1 + 2τ 3 + 2τ 4 + 2τ 5 − 2τ 12 − 2τ 13 − 2τ 14 − 2τ 15 − 4τ 16 ,
    2λ + 2µ + 2ν − 2ρ ≤ 4τ 1 + 2τ 2 + 2τ 3 + 2τ 4 + 2τ 5 − 2τ 12 − 2τ 13 − 2τ 14 − 2τ 16 − 4τ 15 ,
    2λ + 2µ + 2ν + 4ρ ≤ 5τ 1 + 3τ 2 + 3τ 3 + 3τ 4 + τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − τ 12 − 3τ 13 − 3τ 14 − 3τ 15 − 5τ 16 ,
    2λ + 2µ − 2ν + 4ρ ≤ 5τ 2 + 3τ 1 + 3τ 3 + 3τ 4 + τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − τ 12 − 3τ 13 − 3τ 14 − 3τ 15 − 5τ 16 ,
    2λ + 2µ − 2ν + 4ρ ≤ 5τ 1 + 3τ 2 + 3τ 3 + 3τ 4 + τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − τ 12 − 3τ 13 − 3τ 14 − 3τ 16 − 5τ 15 ,
    2λ + 2µ + 2ν + 6ρ ≤ 6τ 1 + 4τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 4τ 15 − 6τ 16 ,
    2λ + 2µ − 2ν + 6ρ ≤ 6τ 2 + 4τ 1 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 4τ 15 − 6τ 16 ,
    2λ + 2µ − 2ν + 6ρ ≤ 6τ 1 + 4τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 8 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 4τ 15 − 6τ 16 ,
    2λ + 2µ − 2ν + 6ρ ≤ 6τ 1 + 4τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 9 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 4τ 15 − 6τ 16 ,
    2λ + 2µ − 2ν + 6ρ ≤ 6τ 1 + 4τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 4τ 16 − 6τ 15 ,
    2λ + 2µ + 4ν + 4ρ ≤ 6τ 1 + 4τ 2 + 4τ 3 + 2τ 4 + 2τ 5 + 2τ 6 − 2τ 11 − 2τ 12 − 2τ 13 − 4τ 14 − 4τ 15 − 6τ 16 ,
    2λ − 2µ + 4ν + 4ρ ≤ 6τ 2 + 4τ 1 + 4τ 3 + 2τ 4 + 2τ 5 + 2τ 6 − 2τ 11 − 2τ 12 − 2τ 13 − 4τ 14 − 4τ 15 − 6τ 16 ,
    2λ − 2µ + 4ν + 4ρ ≤ 6τ 1 + 4τ 2 + 4τ 4 + 2τ 3 + 2τ 5 + 2τ 6 − 2τ 11 − 2τ 12 − 2τ 13 − 4τ 14 − 4τ 15 − 6τ 16 ,
    2λ − 2µ + 4ν + 4ρ ≤ 6τ 1 + 4τ 2 + 4τ 3 + 2τ 4 + 2τ 5 + 2τ 6 − 2τ 11 − 2τ 12 − 2τ 14 − 4τ 13 − 4τ 15 − 6τ 16 ,
    2λ − 2µ + 4ν + 4ρ ≤ 6τ 1 + 4τ 2 + 4τ 3 + 2τ 4 + 2τ 5 + 2τ 6 − 2τ 11 − 2τ 12 − 2τ 13 − 4τ 14 − 4τ 16 − 6τ 15
    2λ + 2µ + 4ν + 6ρ ≤ 7τ 1 + 5τ 2 + 5τ 3 + 3τ 4 + 3τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − 3τ 12 − 3τ 13 − 5τ 14 − 5τ 15 − 7τ 16 ,
    2λ − 2µ + 4ν + 6ρ ≤ 7τ 2 + 5τ 1 + 5τ 3 + 3τ 4 + 3τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − 3τ 12 − 3τ 13 − 5τ 14 − 5τ 15 − 7τ 16 ,
    2λ − 2µ + 4ν + 6ρ ≤ 7τ 1 + 5τ 2 + 5τ 4 + 3τ 3 + 3τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − 3τ 12 − 3τ 13 − 5τ 14 − 5τ 15 − 7τ 16 ,
    2λ − 2µ + 4ν + 6ρ ≤ 7τ 1 + 5τ 2 + 5τ 3 + 3τ 4 + 3τ 6 + τ 5 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − 3τ 12 − 3τ 13 − 5τ 14 − 5τ 15 − 7τ 16 ,
    2λ − 2µ + 4ν + 6ρ ≤ 7τ 1 + 5τ 2 + 5τ 3 + 3τ 4 + 3τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 12 − 3τ 11 − 3τ 13 − 5τ 14 − 5τ 15 − 7τ 16 ,
    2λ − 2µ + 4ν + 6ρ ≤ 7τ 1 + 5τ 2 + 5τ 3 + 3τ 4 + 3τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − 3τ 12 − 3τ 14 − 5τ 13 − 5τ 15 − 7τ 16 ,
    2λ − 2µ + 4ν + 6ρ ≤ 7τ 1 + 5τ 2 + 5τ 3 + 3τ 4 + 3τ 5 + τ 6 + τ 7 + τ 8 − τ 9 − τ 10 − τ 11 − 3τ 12 − 3τ 13 − 5τ 14 − 5τ 16 − 7τ 15 ,
    2λ + 4µ + 4ν + 6ρ ≤ 8τ 1 + 6τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 6τ 15 − 8τ 16 ,
    −2λ + 4µ + 4ν + 6ρ ≤ 8τ 2 + 6τ 1 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 6τ 15 − 8τ 16 ,
    −2λ + 4µ + 4ν + 6ρ ≤ 8τ 1 + 6τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 8 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 6τ 15 − 8τ 16 ,
    −2λ + 4µ + 4ν + 6ρ ≤ 8τ 1 + 6τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 9 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 6τ 15 − 8τ 16 ,
    −2λ + 4µ + 4ν + 6ρ ≤ 8τ 1 + 6τ 2 + 4τ 3 + 4τ 4 + 2τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 2τ 12 − 4τ 13 − 4τ 14 − 6τ 16 − 8τ 15 ,
    2λ + 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 2 + 6τ 1 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 4 + 4τ 3 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 3 + 4τ 4 + 4τ 6 + 2τ 5 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 8 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 9 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 12 − 4τ 11 − 4τ 13 − 6τ 14 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 14 − 6τ 13 − 6τ 15 − 8τ 16 ,
    2λ − 2µ + 4ν + 8ρ ≤ 8τ 1 + 6τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 6τ 16 − 8τ 15 ,
    2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 2 + 8τ 1 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 4 + 4τ 3 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 3 + 4τ 4 + 4τ 6 + 2τ 5 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 8 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 9 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 12 − 4τ 11 − 4τ 13 − 6τ 14 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 14 − 6τ 13 − 8τ 15 − 10τ 16 ,
    −2λ + 4µ + 6ν + 8ρ ≤ 10τ 1 + 8τ 2 + 6τ 3 + 4τ 4 + 4τ 5 + 2τ 6 + 2τ 7 − 2τ 10 − 2τ 11 − 4τ 12 − 4τ 13 − 6τ 14 − 8τ 16 − 10τ 15""",
}

#: Scenarios :math:`(d_1,\dots,d_n)`, corresponding to :math:`\times_i GL(d_i)`-representation on :math:`\bigotimes_i \mathbb C^{d_i}`.
KLYACHKO_QMP_SCENARIOS = sorted(KLYACHKO_QMP_DATA.keys())

#: Scenarios :math:`(d_1,\dots,d_n)`, corresponding to :math:`\times_i GL(d_i)`-representation on :math:`\bigotimes_i \mathbb C^{d_i}` for which Klyachko's inequalities do not contain any mistake.
KLYACHKO_GOOD_QMP_SCENARIOS = [
    dims for dims in KLYACHKO_QMP_SCENARIOS if dims != (2, 2, 3, 12)
]


def _parse_mixed_ieq(dims, s, qubit_coords=[]):
    """Parse a mixed state inequality for distinguishable particles in Klyachko's format."""
    pmap = {'A': 0, 'B': 1, 'C': 2, 'D': 3, 'E': 4}
    v = [0] * sum(dims)

    def p(side, overall_sign):
        overall_factor = 2 if qubit_coords else 1
        todo = side.split()
        while todo:
            assert todo[0] in ["+", "-"]
            sign = 1 if todo[0] == "+" else -1
            if todo[1] in pmap.keys():
                todo = [todo[0]] + ["1"] + todo[1:]
            coeff = int(todo[1])
            party = pmap[todo[2]]
            if party in qubit_coords:
                v[sum(dims[:party])] = overall_sign * sign * coeff
                v[sum(dims[:party]) + 1] = -overall_sign * sign * coeff
                todo = todo[3:]
            else:
                idx = int(todo[3])
                v[sum(dims[:party]) +
                  idx - 1] = overall_factor * overall_sign * sign * coeff
                todo = todo[4:]
        return v

    s = s.rstrip(" ,.").replace(u"−", "-").replace(u"λ", " A").replace(
        u"µ", " B").replace(u"ν", " C").replace(u"ρ", " D").replace(u"τ", " E")
    lhs, rhs = map(lambda s: str(s).strip(), s.split(u"≤"))
    p("+ " + lhs, -1)
    p("+ " + rhs, 1)
    return (vector(v), 0)


def _klyachko_qmp_bare_ieqs(dims):
    """Return bare inequalities from Klyachko's paper."""
    # trim off last dimension
    assert dims[-1] == prod(dims[:-1])

    # retrieve inequalities from data file
    qubit_coords = []
    ieqs = []
    for line in KLYACHKO_QMP_DATA[dims].splitlines():
        line = line.strip()
        if not line: continue
        # single qubit coordinate metadata?
        _, sep, after = line.partition('# QUBIT_COORDS')
        if sep:
            qubit_coords = map(int, after.split())
            continue

        # parse ieq
        ieq = _parse_mixed_ieq(dims, line, qubit_coords)
        ieqs.append(ieq)
    return ieqs


def _find_qmp_scenario(dims):
    """Find ``dims_klyachko`` and a permutation ``pi`` such that ``dims_permuted = (pi * dims) <= dims_klyachko``.

    Return the triple ``(pi, dims_permuted, dims_klyachko)``."""
    for dims_klyachko in KLYACHKO_GOOD_QMP_SCENARIOS:
        if len(dims) != len(dims_klyachko):
            continue
        for pi in Permutations(len(dims)):
            dims_permuted = perm_action(pi, dims)
            if all(x <= y for (x, y) in zip(dims_permuted, dims_klyachko)):
                return pi, dims_permuted, dims_klyachko
    raise Exception("Cannot obtain %s from Klyachko's scenarios." % (dims, ))


def klyachko_qmp_hrepr(dims, bare=False, irred=True):
    r"""Return the moment polytope for the :math:`\times_i GL(d_i)`-representation on :math:`\bigotimes_i \mathbb C^{d_i}` as computed in `Klyachko (2004) <https://arxiv.org/abs/quant-ph/0409113>`_.

    See :data:`KLYACHKO_QMP_SCENARIOS` and :data:`KLYACHKO_GOOD_QMP_SCENARIOS` for available scenarios.
    Sub-scenarios of these scenarios are also supported (i.e., :math:`d'_{\pi(i)} \leq d_i` for some permutation :math:`\pi`).

    :param dims: the dimensions :math:`(d_1,\dots,d_n)`.
    :param bare: if ``True`` then permutations, positivity, and Weyl chamber inequalities are omitted.
    :param irred: if ``True`` then an irredunant H-representation is returned.
    :rtype: :class:`moment_polytopes.HRepr`
    """
    # look up klyachko scenario
    dims = tuple(dims)
    if bare:
        dims_klyachko = tuple(dims)
        assert dims_klyachko in KLYACHKO_QMP_SCENARIOS
    else:
        pi, dims_permuted, dims_klyachko = _find_qmp_scenario(dims)
        pi_inverse = pi.inverse()

    # fetch bare inequalities
    bare_ieqs = _klyachko_qmp_bare_ieqs(dims_klyachko)
    if bare:
        hrepr = HRepr(ieqs=bare_ieqs)
        return hrepr.irred() if irred else hrepr

    # permute and truncate bare inequalities
    stab = StabilizerGroup(dims_klyachko)
    ieqs = set()
    for H, z in bare_ieqs:
        # extract
        hs = [
            tuple(H[sum(dims_klyachko[:i]):sum(dims_klyachko[:i + 1])])
            for i in range(len(dims_klyachko))
        ]

        # permute subsystems
        for hs_permuted in stab.orbit([hs]):
            # truncate
            hs_permuted = [h[:d] for (h, d) in zip(hs_permuted, dims_permuted)]

            # permute back
            hs_permuted = perm_action(pi_inverse, hs_permuted)
            H_permuted = sum(hs_permuted, ())

            # add ieq
            ieq = (H_permuted, z)
            ieqs.add(ieq)

    # add positivity for all parties [[ more conceptually, we should ONLY add lambda_{AB,ab} >= 0 and get the other ones either implicitly (if dims_permuted == dims_klyachko) or from tracing out the Weyl chamber inequalities ]]
    for k in range(len(dims)):
        H, z = (0, ) * sum(dims[:k]) + (0, ) * (dims[k] - 1) + (1, ) + (
            0, ) * sum(dims[k + 1:]), 0
        ieqs.add((H, z))

    # intersect with reduced Weyl chamber
    R = external_tensor_product(dims)
    hrepr = HRepr(ieqs=ieqs) & R.reduced_positive_weyl_chamber_hrepr

    # make irredundant?
    return hrepr.irred() if irred else hrepr


def higuchi_hrepr(num_qubits=3):
    """Return moment polytope for multi-qubit pure states computed by `Higuchi, Sudbery, and Szulc (2003) <https://arxiv.org/abs/quant-ph/0209085>`_.

    :param num_qubits: the number of qubits.
    :rtype: :class:`moment_polytopes.HRepr`
    """
    # polygonal inequalities
    ieqs = []
    for k in range(num_qubits):
        H, z = (-1, 0) * k + (1, 0) + (-1, 0) * (num_qubits - k - 1
                                                 ), 2 - num_qubits
        ieqs.append((H, z))

    # positivity
    for k in range(num_qubits):
        H, z = (0, 0) * k + (0, 1) + (0, 0) * (num_qubits - k - 1), 0
        ieqs.append((H, z))

    # bring inequalities into canonical form (traceless, integral components)
    dims = [2] * num_qubits
    ieqs = [qmp.facet_normal_form(dims, ieq) for ieq in ieqs]
    R = external_tensor_product(dims)
    return HRepr(ieqs=ieqs) & R.reduced_positive_weyl_chamber_hrepr


def bravyi_hrepr():
    """Return moment polytope for :math:`\mathbb C^2 \otimes \mathbb C^2 \otimes \mathbb C^4` computed by `Bravyi (2004) <https://arxiv.org/abs/quant-ph/0301014>`_.

    :rtype: :class:`moment_polytopes.HRepr`
    """
    ieqs = [
        ((-1, 0, 0, 0, 1, 1, 0, 0), 0),
        ((0, 0, -1, 0, 1, 1, 0, 0), 0),
        ((-1, 0, -1, 0, 1, 0, 0, -1), -1),
        ((-1, 0, 1, 0, 1, 0, -1, 0), 0),
        ((-1, 0, 1, 0, 0, 1, 0, -1), 0),
        ((1, 0, -1, 0, 1, 0, -1, 0), 0),
        ((1, 0, -1, 0, 0, 1, 0, -1), 0),
        ((0, 1, 0, 0, 0, 0, 0, 0), 0),
        ((0, 0, 0, 1, 0, 0, 0, 0), 0),
        ((0, 0, 0, 0, 0, 0, 0, 1), 0),
    ]

    # bring inequalities into canonical form (traceless, integral components)
    dims = [2, 2, 4]
    ieqs = [qmp.facet_normal_form(dims, ieq) for ieq in ieqs]
    R = external_tensor_product(dims)
    return HRepr(ieqs=ieqs) & R.reduced_positive_weyl_chamber_hrepr


def franz_hrepr():
    """Return moment polytope for :math:`\mathbb C^3 \otimes \mathbb C^3 \otimes \mathbb C^3` computed by `Franz (2002) <http://www.emis.de/journals/JLT/vol.12_no.2/16.html>`_.

    :rtype: :class:`moment_polytopes.HRepr`
    """
    """Return H-representation of the Franz polytope for 3x3x3."""
    dims = [3, 3, 3]
    stab = StabilizerGroup(dims)

    # Franz' raw inequalities <H,lambda> <= 0 with permutations removed (observe the sign!)
    franz_data = """
1 0 0 ; 1 0 0 ; -2 -1 -1
1 1 0 ; 1 0 0 ; -2 -2 -1
0 1 0 ; 1 0 0 ; -1 -2 -1
2 0 1 ; 2 0 1 ; -4 -2 -3
2 0 1 ; 2 1 0 ; -4 -3 -2
1 2 0 ; 2 0 1 ; -3 -4 -2
1 2 0 ; 2 1 0 ; -4 -3 -2

0 0 0 ; 0 0 0 ; 0 0 -1
  """

    # convert normal vectors to our format and add in permutations
    hss_wo_perms = [[
        tuple([-int(x) for x in h.split()]) for h in line.split(';')
    ] for line in franz_data.splitlines() if line.strip()]
    hss = stab.orbit(hss_wo_perms)
    Hs = [sum(hs, ()) for hs in hss]
    ieqs = [(vector(H), 0) for H in Hs]

    # bring inequalities into canonical form (traceless components)
    ieqs = [qmp.facet_normal_form(dims, ieq) for ieq in ieqs]
    R = external_tensor_product(dims)
    return HRepr(ieqs=ieqs) & R.reduced_positive_weyl_chamber_hrepr
